<template lang="pug">
section.golden-girls
	.title LOAD
	- var n = 1
	- var places = ["Nothin' Here","Blanche House: Evening","Prototype Save - The Long Titlening: Afternoon of the Second Summer Solstice","Dark Peter's Chambers: Morning","Starbucks 2: Evening","Blue Room: Afternoon","Ray Min's Noodle Cart: 2AM","Home of Freddie Freaker: Evening","Hufflepuff Dormitories: Night","Blanche's Home - Repreive","Blood Gulch: Eternal Afternoon","Schoolyard: Lunch","Dark Peter's Chambers: Witness Ascension","Whiterun Prison: Early Morning","Starbucks HQ: ???","Blanche House (Skrillex & DJ Khaled Re-Tool)","Your Office: 10 Minutes Before Close","Bagel Shop: Morning","rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ rͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬͬaͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣͣtͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭͭ"];
	- var days = ["SUN", "MON", "TUE", "WED", "THU", "FRI", "SAT"]
	#bg
	#saveframe
		.allsaves
			while n < places.length
				.save(id='save'+n)
					.save--num= n 
					.save--date= Math.ceil(Math.random()*11)+" / "+Math.ceil(Math.random()*30)
						.save--day= days[n%7]
					.save--name= places[n++]
						.save--data 
							.save--difficulty Normal
							.save--playtime= Math.floor(Math.random()*69)+"h "+Math.floor(Math.random()*60)+"m"
							.save--level= Math.floor(Math.random()*69)
	#popup
</template>

<script>
import './index'
export default {
	name: 'GoldenGirls',
	data() {
		return {
		}
	},
	props: {},
	methods:{}
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped lang="stylus">

@import url('https://fonts.googleapis.com/css?family=Fjalla+One');
section
	background magenta
	font-family: 'Fjalla One', sans-serif;
	height 100%
	overflow hidden
	position relative
*
	user-select none
.title
	color white
	font-size 57px
#bg
	content ' '
	background magenta url(https://s3-us-west-2.amazonaws.com/s.cdpn.io/522641/psalms.jpg);	
	transform .5s ease
	filter grayscale(50%) sepia(20%) brightness(0.8);
	//credit: https://unsplash.com/photos/CcETP4gFBTU
	width 100%
	height 100%
	position absolute
	background-size cover
	background-position center
	overflow: hidden;
	z-index 0
	top 44px
	transform skewY(-2deg)
#saveframe	
	overflow hidden
	width 100%
	height 95%
	position absolute
	top 44px	
	transform skewY(-2deg)
	overflow-Y hidden
	z-index 1
	
.allsaves
	overflow-y scroll
	overflow-x hidden
	max-height 110vh
	transform translateX(0)
	padding-right: 17px;
	box-sizing: content-box;
// for pen in (1..10)
// 	.save:nth-child({pen}) 
// 		transform translateX(40+((pen - 3)*20)%) rotate(2deg)
.save
	// transition transform .01s linear
	padding 6px
	margin 20px
	position relative
	savewidth = 90%
	width savewidth
	display flex
	justify-content space-around
	&:first-child
		margin-top 20vh
	act()
		color white
		&::after 
			opacity 1
		&::before			
			transition .5s ease
			top 5px
			left 5px
		.save--num
			animation numwiggle ease 3s infinite
	&.save--active
		act()
	&:hover
		act()		
	&::after
		position absolute
		transition .5s ease
		opacity 0
		top -5px
		left -5px
		transform skewX(15deg)
		background magenta
		width 100%
		height 100%
		z-index -1
		content ''
	&::before
		position absolute
		top 0
		left 0
		transform skewX(15deg)
		background white
		width 100%
		height 100%
		z-index -1
		content ''
	.save--num
		color darkmagenta
		background: -webkit-linear-gradient(magenta, black);
		-webkit-background-clip: text;
		-webkit-text-fill-color: transparent;
		-webkit-text-stroke-width: 2px;
		transform rotate(5deg)
		font-size 48pt
		margin 0px 10px
	.save--date
		font-size 30pt
		margin 0px 10px 0px 0px
		width 160px
		text-align right
		.save--day
			font-size 18px
			text-align right
	.save--name
		font-size 32px
		flex-wrap wrap
		width 100%		
		text-overflow ellipsis
		white-space: nowrap;
		overflow-x: hidden;
		.save--data
			font-size 18px
			flex-grow 10
			width 100%
			display flex
			justify-content space-evenly
		.save--difficulty
			background rgb(0,165,217)
			padding 5px
			transform skewX(3deg)
			margin 0px 10px 0 0
		.save--playtime 
			padding 5px
			font-style: italic;
			margin 0px 10px 0 3px
			&::before
				content 'PLAY TIME: '
				font-style: normal;
		.save--level 
			padding 5px
			font-style: italic;
			margin 0px 10px 0 3px
			&::before
				content 'AVG LVL: '
				font-style: normal;
		
	
@keyframes numwiggle{
	0%,100%{transform-origin:50% 50%}
	0%,20%,40%,60%,80%,100%{transform:rotate(4deg)}
	10%,30%,50%,70%,90%{transform:rotate(-4deg)}
}

dialogue()
	clip-path: polygon(19% 20%, 100% 0%, 89% 96%, 0% 100%);
	position absolute
	z-index -1
	top -30%
	left -25%
	width 140%
	height 130%
	content ''
	background black
.dialogue
	position absolute
	z-index 100
	left: 50%;
	top: 50%;
	transform: translate(-50%, -50%);
	width: 40%;
	height: 50%
	font-size 4vw
	animation diaglogue .7s cubic-bezier(.25,.46,.45,.94) both
	&::before
		dialogue()	
		top -26%
		left -23%
	&::after
		dialogue()
		background white
	.di--messageholder
		height 80%
	.di--message
		position: relative;
		top: 50%;
		transform: translateY(-50%); 
	.di--buttonholder
		position absolute
		bottom 4vh
	button		
		border: none;
		margin: 0px;
		font-size 2vw
		z-index 1
		padding: 1vw 2vw .5vw 4vw
		clip-path: polygon(19% 20%, 100% 0%, 89% 96%, 0% 100%);
		width: auto;
		overflow: visible;
		cursor pointer
		background: transparent;
		color: inherit;
		font-family: inherit;
		line-height: normal;
		-webkit-font-smoothing: inherit;
		-moz-osx-font-smoothing: inherit;
		-webkit-appearance: none;
	.di-nobutton
		background lightgray	
	.di-yesbutton
		background magenta
@keyframes diaglogue {
  0% {    
	 opacity: 0;
  }
  100% {
	 opacity: 1;
  }
}
		

</style>
